"""
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.
"""
seasons_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]

seasons_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень",
                10: "осень", 11: "осень", 12: "зима"}

while True:
    answ = input("Введите месяц в виде целого числа от 1 до 12: ")

    if answ.isdigit():
        answ = int(answ)

        if 1 <= answ <= 12:
            print(f"\nВремя года из 'списка' - {seasons_list[answ-1]}"
                  f"\nВремя года из 'словаря'- {seasons_dict.get(answ)}")
            break
